AUTO_config_TK_pesok/src/Documents/ТК_ОптимальноеКоличествоНоменклатуры/ТК_ОптимальноеКоличествоНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТК_ОптимальноеКоличествоНоменклатуры</name>
  <registerRecords>InformationRegister.ТК_ОптимальноеКоличествоНоменклатуры</registerRecords>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа - пользователь, создавший документ.</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Произвольный комментарий к документу</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ТорговаяПлощадка</name>
      <type>
        <types>CatalogRef.ТорговыеПлощадки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <comment>Номенклатура (товар, услуга и т.п.)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>МодельЗаказа</name>
      <type>
        <types>EnumRef.ВидыКоличестваЗаказа</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОкругления</name>
      <type>
        <types>EnumRef.ВариантыОкругленияКоличества</types>
      </type>
    </attributes>
    <attributes>
      <name>МинимальныйОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальныйЗапас</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоДоговоруОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВитринаОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КвантПоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/Enums/ВидыКоличестваЗаказа/ВидыКоличестваЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКоличестваЗаказа</name>
  <comment>Виды количества заказа</comment>
  <enumValues>
    <name>Фиксированное</name>
    <comment>Заказывать фиксированное количество</comment>
  </enumValues>
  <enumValues>
    <name>ДополнятьДоМаксимальногоЗапаса</name>
    <comment>Дополнять остаток до максимального запаса</comment>
  </enumValues>
  <enumValues>
    <name>ДополнятьДоУказанногоКоличества</name>
    <comment>Дополнять остаток до указанного количества</comment>
  </enumValues>
  <enumValues>
    <name>ДополнятьДоМинимальногоКоличества</name>
    <comment>Дополнять остаток до минимального количества</comment>
  </enumValues>
  <enumValues>
    <name>АвтоматическийРассчет</name>
    <comment>Автоматический расчет требуемого количества</comment>
  </enumValues>
  <enumValues>
    <name>АвтоматическийРассчетУльтраФреш</name>
    <comment>Автоматический расчет требуемого количества для Ультрафреш</comment>
  </enumValues>
  <enumValues>
    <name>АвтоматическийРассчетБезОстатков</name>
    <comment>Автоматический расчет требуемого количества без учета остатков</comment>
  </enumValues>
  <enumValues>
    <name>АвтоматическийРассчетСигаретДигма</name>
    <comment>Автоматический расчет требуемого количества</comment>
  </enumValues>
  <enumValues>
    <name>БезВсплесков7Дней</name>
    <comment>Автоматический расчет требуемого количества</comment>
  </enumValues>
  <enumValues>
    <name>РФМ</name>
    <comment>Дополнять до минимального количества</comment>
  </enumValues>
  <enumValues>
    <name>АттикаАвтоРассчетДляРЦ</name>
    <comment>Автоматический расчет требуемого количества</comment>
  </enumValues>
  <enumValues>
    <name>КассоваяЛента</name>
  </enumValues>
  <enumValues>
    <name>ОстатокНа7Дней</name>
  </enumValues>
  <enumValues>
    <name>Вендинг</name>
  </enumValues>
  <enumValues>
    <name>АвтоРасчетАСУ</name>
    <comment>(АСУ) Авто расчет</comment>
  </enumValues>
</mdclass:Enum>

AUTO_config_TK_pesok/src/Enums/ВариантыОкругленияКоличества/ВариантыОкругленияКоличества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыОкругленияКоличества</name>
  <enumValues>
    <name>НеОкруглять</name>
  </enumValues>
  <enumValues>
    <name>ДробноеКоличествоВМеньшуюСторону</name>
  </enumValues>
  <enumValues>
    <name>ДробноеКоличествоВБольшуюСторону</name>
  </enumValues>
  <enumValues>
    <name>КвантПоставкиВМеньшуюСторону</name>
  </enumValues>
  <enumValues>
    <name>КвантПоставкиВБольшуюСторону</name>
  </enumValues>
  <enumValues>
    <name>БольшеПоловиныУпаковкиВБольшуюСторону</name>
  </enumValues>
</mdclass:Enum>

AUTO_config_TK_pesok/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Артикул</name>
    <comment>Код производителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Наименование2</name>
    <comment>Локализованное наименование 2</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазоваяЕдиницаИзмерения</name>
    <comment>Базовая единица измерения номенклатуры</comment>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЕдиницаИзмерения</name>
    <comment>Основная единица измерения номенклатуры</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияУпаковки</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияЯщиков</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <comment>Тип номенклатуры</comment>
    <type>
      <types>CatalogRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <comment>Вид номенклатуры</comment>
    <type>
      <types>EnumRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяМарка</name>
    <type>
      <types>CatalogRef.ТоварныеМарки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <comment>Ставка НДС по умолчанию для оформления документов</comment>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <comment>Страна происхождения по умолчанию</comment>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокХраненияТовара</name>
    <comment>Срок хранения товара (в днях)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Глубина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаЦенообразования</name>
    <comment>Группа ценообразования</comment>
    <type>
      <types>CatalogRef.ГруппыЦенообразования</types>
    </type>
  </attributes>
  <attributes>
    <name>КодУКТВЭД</name>
    <type>
      <types>CatalogRef.КлассификаторУКТВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>АкцизГруппа</name>
    <comment>Группа акциза</comment>
    <type>
      <types>CatalogRef.ГруппыАкциза</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДляБухгалтерии</name>
    <comment>Группа для бухгалтерии</comment>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатурыПланирования</name>
    <type>
      <types>CatalogRef.ТипНоменклатурыПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеХарактеристик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойАртикул</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипИндикатива</name>
    <type>
      <types>CatalogRef.ТК_ТипыИндикатива</types>
    </type>
  </attributes>
  <attributes>
    <name>Крепость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеRB</name>
    <comment>Наименование  для Radio Beacon</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентВыгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.ТК_Производитель</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодакцизныйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеАктивный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_Товара</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставНабора</name>
    <comment>Состав набора</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>Номенклатура</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <comment>Характеристика номенклатуры</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособРасчетаЦены</name>
      <comment>Способ расчета цены реализации</comment>
      <type>
        <types>EnumRef.СпособыРасчетаЦены</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/Documents/ТК_ОптимальноеКоличествоНоменклатуры/Forms/ФормаЗагрузкиДанныхИзТабДок/Module.bsl
&НаСервере
Перем КэшиПеречислений, ТчТовары; 


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтруктураКолонок = Параметры.СтруктураКолонок;
	ЭтоАттика = Параметры.ЭтоАттика;
	СписокПараметров.Добавить(Параметры.ТчТовары,"ТчТовары");	
	СписокПараметров.Добавить(Параметры.КэшиПеречислений,"КэшиПеречислений");	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЭтоАттика Тогда
		Элементы.ФормаТпИзСкладов.Видимость = Ложь;	
		Элементы.ФормаТпИзМатрицы.Видимость = Ложь;	
	КонецЕсли;
	СформироватьШапкуТабличногоДокумента(ТабДокумент,СтруктураКолонок);
КонецПроцедуры

&НаСервере
Функция ПреобразоватьТабличныйДокументВТаблицуЗначений(ТабДокумент) 
	ПоследняяСтрока = ТабДокумент.ВысотаТаблицы;
	ПоследняяКолонка = ТабДокумент.ШиринаТаблицы;
	ОбластьЯчеек = ТабДокумент.Область(1, 1, ПоследняяСтрока, ПоследняяКолонка); 
	// Создаем описание источника данных на основании области ячеек табличного документа.
	ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьЯчеек);  
	// Создаем объект для интеллектуального построения отчетов,
	// указываем источник данных и выполняем построение отчета.
	ПостроительОтчета = Новый ПостроительОтчета; 
	ПостроительОтчета.ИсточникДанных = ИсточникДанных;
	ПостроительОтчета.Выполнить();
	// Результат выгружаем в таблицу значений.
	ТабЗначений = ПостроительОтчета.Результат.Выгрузить();
	Возврат ТабЗначений
КонецФункции

&НаСервере
Функция ПолучитьЗначение(ИмяКолонки, Значение) 
	
	Если ИмяКолонки = "Номенклатура" тогда
		ПолученноеЗначение = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",Значение);
		Если Не ЗначениеЗаполнено(ПолученноеЗначение) Тогда
			ПолученноеЗначение = Справочники.Номенклатура.НайтиПоНаименованию(Значение);
		КонецЕсли;
	ИначеЕсли ИмяКолонки = "ТорговаяПлощадка" тогда
		
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТорговыеПлощадки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТорговыеПлощадки КАК ТорговыеПлощадки
		|ГДЕ
		|	ТорговыеПлощадки.Наименование = &Наименование";
		
		Запрос.УстановитьПараметр("Наименование", Значение);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если  РезультатЗапроса.Пустой() Тогда
			ПолученноеЗначение = Справочники.ТорговыеПлощадки.ПустаяСсылка();
		Иначе	
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			ВыборкаДетальныеЗаписи.Следующий();
			
			ПолученноеЗначение  = ВыборкаДетальныеЗаписи.Ссылка;
			
		КонецЕсли;
		
		//ПолученноеЗначение = Справочники.ТорговыеПлощадки.НайтиПоНаименованию(Значение);
	ИначеЕсли ИмяКолонки = "МодельЗаказа" тогда
		СсылкаПеречисление = СписокПараметров[1].Значение.КэшМоделейЗаказа.Получить(Значение);
		ПолученноеЗначение = ?(СсылкаПеречисление=Неопределено,Перечисления.ВидыКоличестваЗаказа.АвтоматическийРассчет,СсылкаПеречисление);
	ИначеЕсли ИмяКолонки = "ВариантОкругления" тогда
		СсылкаПеречисление = СписокПараметров[1].Значение.КэшВариантовОкругления.Получить(Значение);
		ПолученноеЗначение = ?(СсылкаПеречисление=Неопределено,Перечисления.ВариантыОкругленияКоличества.КвантПоставкиВБольшуюСторону,СсылкаПеречисление);
	Иначе
		ПолученноеЗначение = Значение;
	КонецЕсли;
	
	Возврат ПолученноеЗначение;
КонецФункции	

&НаСервере
Функция ЗагрузитьНаСервере()
	ТзТп = ПреобразоватьТабличныйДокументВТаблицуЗначений(ТабДокумент);
	ТЗ = СписокПараметров[0].Значение.Выгрузить().СкопироватьКолонки();
	КолонкиТаблицы = ТзТп.Колонки;
	Для каждого ТекСтрока из ТзТп Цикл
		НоваяСтрока = ТЗ.Добавить();
		Для каждого ТекСтрокаКолонка из КолонкиТаблицы Цикл
			Если НЕ ТекСтрока[ТекСтрокаКолонка.Имя] = "" тогда
				Значение = ПолучитьЗначение(ТекСтрокаКолонка.Имя,ТекСтрока[ТекСтрокаКолонка.Имя]);
				НоваяСтрока[ТекСтрокаКолонка.Имя] = Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТЗ);
КонецФункции

&НаКлиенте
Процедура Загрузить(Команда)
	Закрыть(ЗагрузитьНаСервере());
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СформироватьШапкуТабличногоДокумента(ТабличныйДокумент,СтруктураКолонок) Экспорт
	ТабличныйДокумент.Очистить();
	Колонки = Новый СписокЗначений;
	Номер = 0;
	Для каждого ТекСтрока из СтруктураКолонок цикл
		Если не ТекСтрока.Ключ = "НомерСтроки" тогда
			Номер = Номер + 1;
			Колонки.Добавить(Номер, ТекСтрока.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
	
	Колонки.СортироватьПоЗначению();
	ШиринаКолонки = 25;
	Для каждого Колонка Из Колонки Цикл	
		НомерКолонки = Число(Колонка.Значение);
		Область = ТабличныйДокумент.Область("R1C"+НомерКолонки);
		БылТекст = Не ПустаяСтрока(Область.Текст);
		Область.Текст       = Колонка.Представление;
		Область.Расшифровка = Колонка.Представление;
		Область.ЦветФона = ЦветаСтиля.ЦветФонаФормы;
		Область.Обвести(Линия, Линия, Линия, Линия);
		
		ОбластьКолонки = ТабличныйДокумент.Область("C"+НомерКолонки);
		ОбластьКолонки.ШиринаКолонки = ?(БылТекст,Макс(ОбластьКолонки.ШиринаКолонки,ШиринаКолонки),ШиринаКолонки);
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПереформироватьТабДокСПлощадками(ТабличныйДокумент,СтруктураКолонок,ТЗ) Экспорт
	ТабличныйДокумент.Очистить();
	Колонки = Новый СписокЗначений;
	Номер = 0;
	Для каждого ТекСтрока из СтруктураКолонок цикл
		Если не ТекСтрока.Ключ = "НомерСтроки" тогда
			Номер = Номер + 1;
			Колонки.Добавить(Номер, ТекСтрока.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
	
	Колонки.СортироватьПоЗначению();
	ШиринаКолонки = 25;
	
	Для каждого Колонка Из Колонки Цикл	
		НомерКолонки = Число(Колонка.Значение);
		Область = ТабличныйДокумент.Область("R1C"+НомерКолонки);
		БылТекст = Не ПустаяСтрока(Область.Текст);
		Область.Текст       = Колонка.Представление;
		Область.Расшифровка = Колонка.Представление;
		Область.ЦветФона = ЦветаСтиля.ЦветФонаФормы;
		Область.Обвести(Линия, Линия, Линия, Линия);
		
		ОбластьКолонки = ТабличныйДокумент.Область("C"+НомерКолонки);
		ОбластьКолонки.ШиринаКолонки = ?(БылТекст,Макс(ОбластьКолонки.ШиринаКолонки,ШиринаКолонки),ШиринаКолонки);
	КонецЦикла;
	
	Для каждого строка Из ТЗ Цикл
		НомерСтроки = Формат(ТЗ.Индекс(строка) + 2,"ЧГ=");
		Для каждого Колонка Из Колонки Цикл	
			НомерКолонки = Число(Колонка.Значение);
			Область = ТабличныйДокумент.Область("R"+НомерСтроки+"C"+НомерКолонки);
			Область.Текст       = строка[Колонка.Представление];
			Область.Расшифровка = строка[Колонка.Представление];
			Область.ЦветФона = ЦветаСтиля.ЦветФонаШапкиТаблицы;
			Область.Обвести(Линия, Линия, Линия, Линия);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьПлощадкиИзСкладов(Кнопка)
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСклад(Код)
	Возврат Справочники.СкладыКомпании.НайтиПоКоду(Код);
КонецФункции


&НаСервере
Процедура ВводСтроки(ПолученноеЗначение, ПереданныеПараметры) Экспорт
	
	СписокПлощадок = Новый СписокЗначений;
	
	Для й=1 По СтрЧислоСтрок(ПолученноеЗначение) Цикл
		зн = СокрЛП(СтрПолучитьСтроку(ПолученноеЗначение,й));
		Если ПустаяСтрока(зн) Тогда
			Продолжить;
		КонецЕсли;
		
		нНом = ПолучитьСклад(зн);
		Если нНом = ПредопределенноеЗначение("Справочник.СкладыКомпании.ПустаяСсылка") Тогда
			Сообщить("Склад не найдена, код: " +зн);
			Продолжить;
		КонецЕсли;
		
		Если нНом.ЭтоГруппа Тогда
			Сообщить("Введена группа склада '"+нНом+"'");
			Продолжить;
		КонецЕсли;
		
		Если нНом.ТорговаяПлощадка = ПредопределенноеЗначение("Справочник.ТорговыеПлощадки.ПустаяСсылка") Тогда
			Сообщить("Торговая площадка не заполнена у склада: " +нНом);
			Продолжить;
		КонецЕсли;
		
		Если СписокПлощадок.НайтиПоЗначению(нНом.ТорговаяПлощадка)= Неопределено Тогда
			СписокПлощадок.Добавить(нНом.ТорговаяПлощадка);
		КонецЕсли;
	КонецЦикла;
	
	ТЗ = ПреобразоватьТабличныйДокументВТаблицуЗначений(ТабДокумент);
	тзСПлощадками = ТЗ.СкопироватьКолонки();
	тзСПлощадками.Колонки.Удалить("ТорговаяПлощадка");
	тзСПлощадками.Колонки.Добавить("ТорговаяПлощадка");
	Для каждого Площадка Из СписокПлощадок Цикл	
		Для каждого строка Из ТЗ Цикл
			ЗаполнитьЗначенияСвойств(тзСПлощадками.Добавить(),строка);
			тзСПлощадками[тзСПлощадками.Количество()-1].ТорговаяПлощадка = Площадка.Значение;
		КонецЦикла;
	КонецЦикла;
	
	ПереформироватьТабДокСПлощадками(ТабДокумент,СтруктураКолонок,тзСПлощадками);
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ТпИзСкладовНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТпИзСкладов(Команда)
	Текст = "";
	Подсказка = "Введите код склада, новый код с новой строки";
	СписокПлощадок = Новый СписокЗначений;
	Строка = "";
	ОписаниеОповещения = Новый ОписаниеОповещения("ВводСтроки", ЭтаФорма);
	ПоказатьВводСтроки(ОписаниеОповещения, Строка, Подсказка,,Истина);
	//ТпИзСкладовНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокМатриц()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АссортиментнаяМатрица.Ссылка КАК Матрица
	|ИЗ
	|	Справочник.АссортиментнаяМатрица КАК АссортиментнаяМатрица
	|АВТОУПОРЯДОЧИВАНИЕ"	;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//создадим список значений
	СписокМатриц = Новый СписокЗначений;
	//загрузим значения колонки
	СписокМатриц.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Матрица"));
	Возврат СписокМатриц;
КонецФункции

&НаСервере
Процедура ТпИзМатрицыНаСервере(ВыбранныеМатрицы)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкладыКомпании.ТорговаяПлощадка КАК ТорговаяПлощадка
	|ИЗ
	|	Справочник.СкладыКомпании КАК СкладыКомпании
	|ГДЕ
	|	СкладыКомпании.АссортиментнаяМатрица В(&АссортиментнаяМатрица)
	|	И НЕ СкладыКомпании.ЭтоГруппа
	|	И НЕ СкладыКомпании.ПометкаУдаления
	|	И (СкладыКомпании.Маршрут > 0
	|			ИЛИ СкладыКомпании.АссортиментнаяМатрица.Код = ""AT000008"")
	|
	|СГРУППИРОВАТЬ ПО
	|	СкладыКомпании.ТорговаяПлощадка
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("АссортиментнаяМатрица", ВыбранныеМатрицы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		
		ТЗ = ПреобразоватьТабличныйДокументВТаблицуЗначений(ТабДокумент);
		тзСПлощадками = ТЗ.СкопироватьКолонки();
		тзСПлощадками.Колонки.Удалить("ТорговаяПлощадка");
		тзСПлощадками.Колонки.Добавить("ТорговаяПлощадка");
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Для каждого строка Из ТЗ Цикл
				ЗаполнитьЗначенияСвойств(тзСПлощадками.Добавить(),строка);
				тзСПлощадками[тзСПлощадками.Количество()-1].ТорговаяПлощадка = ВыборкаДетальныеЗаписи.ТорговаяПлощадка;
			КонецЦикла;
		КонецЦикла;
		
		ПереформироватьТабДокСПлощадками(ТабДокумент,СтруктураКолонок,тзСПлощадками);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Пусто!!!");
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ТпИзМатрицы(Команда)
	СписокМатриц = ПолучитьСписокМатриц();
	
	ОповещениеПослеОтметкиЭлементов = Новый ОписаниеОповещения("ПослеОтметкиЭлементов", ЭтотОбъект);	
	СписокМатриц.ПоказатьОтметкуЭлементов(ОповещениеПослеОтметкиЭлементов,"Выберите нужные матрицы");
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтметкиЭлементов(Элементы, Параметры) Экспорт
	
	Если Элементы <> Неопределено Тогда
		ВыбранныеМатрицы = Новый СписокЗначений;
		Для Каждого Элемент из Элементы Цикл
			Если Элемент.Пометка Тогда
				ВыбранныеМатрицы.Добавить(Элемент.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ВыбранныеМатрицы) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Надо было выбрать хоть что-то!!!");
		Возврат;
	КонецЕсли;
	
	ТпИзМатрицыНаСервере(ВыбранныеМатрицы);	
	
КонецПроцедуры
